<html>
<title>多維陣列</title>
<body>
<?php
$A = array(
         0 => array(          //設定第0列
                  0 => "00" ,
                  1 => "01" ,
                  2 => "02"
                  ) ,         
         1 => array(          //設定第1列
                  0 => "10",
                  1 => "11",
                  2 => "12"
                  ),
         2 => array(           //設定第2列
                  0 => "20",
                  1 => "21",
                  2 => "22"
                  )
       ) ;
echo "顯示陣列內容<br>";
for ($B=0; $B<=2; $B++){        
   for ($c=0; $c<=2; $c++)      
      echo $A[$B][$c].", " ;       
echo "<br>" ;
   }
?>
</body>
</html>
